poisellePlacaPlanas/Re-20/m-25k-new/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         1000;

deltaT          1;

writeControl    runTime;

writeInterval   100;

purgeWrite      0;

writeFormat     ascii;

writePrecision   6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

// ************************************************************************* //

functions
{   

    //#includeFunc residuals(p, U)
    //#includeFunc graphCell(funcName=graph, start=(0 0 0), end=(1 0 0), U)
    //#includeFunc probes(funcName=probes, points=((1 0 0)), U)

	/*fAceleracao
	{
		type coded;
		libs ("libutilityFunctionObjects.so");
		name fAceleracao;
		writeControl outputTime;
		//writeInterval	0.1;
		
		codeExecute
		#{
			Info<< "\t Calculo da aceleracao convectiva" << endl;

			// Lookup U
			const volVectorField& U = mesh().lookupObject<volVectorField>("U");
			
			volVectorField Aconv
			(
				IOobject
                		(
                    			"Aconv",
                    			mesh().time().timeName(),
                    			U.mesh(),
                    			IOobject::READ_IF_PRESENT,
                    			IOobject::AUTO_WRITE
                		),
                		U & fvc::grad(U)
            		);
            		Aconv.write();
			Info << endl;
		#};

	}*/
}

