poisellePlacaPlanas/Re-20/m-25k-new/system/sampleUmax
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    location        "system";
    object          sample;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "constant/variaveis"

type sets;
libs ("libsampling.so");
interpolationScheme cellPoint;

setFormat csv;

sets
(
    linhaCentral
    {
	type            lineUniform; 
	nPoints		$nX;
        axis		x;
        start           (0    		0  $meiozCanal);
        end             ($LCanal  	0  $meiozCanal);
    }
);

fields
(
    U
    p
);


// ************************************************************************* //
